
class User:
	def__init__(self, name:str, surname:str):

class user:
name:str
surname:str
#создать хэш-таблицу с присвоением каждому user номер телефона или логин
def create_hach:
    user_hach = {}
	user_hach[name]= #значение - номер телефона или спец. логин
#создать словарь. Ключ - логин или номер телефона, а значение - пароль
# правильность ввода пароля будет проверяться с использованием булевого типа
def user_online(name): #функция поиска пользователей онлайн и вывода списка этих пользователей
     online = [] #пустой список для добавления пользователей в онлайне
	 #найти пользователя
	 #проверить его в онлайн
	 if user_online True: #добавить в список
	    online += []
	return online
# переменные, характеризующие передаваемые и хранимые сообщения
date #переменная, содержащая дату создания сообщения
time #переменная, содержащая время создания сообщения
massege: str = input() #переменная - вводимое текстовое сообщение
# создать очередь сообщений для хранения данных
from collections import deque
queue.append(x) #добавление сообщения в очередь
#функция поиск по историии собщений: по ключевому слову в строке, для такого использовать цикл for (насколько знаю, надо использовать библиотеку re)
#отправить сообщение, добавить сообщение в очередь
#извлечь сообщение из очереди, чтобы другой пользователь мог прочесть
